In [2]:
pip install pandas #in cmd prompt or anaconda
!pip install pandas #jupyter

SyntaxError: invalid syntax (3618376785.py, line 1)

In [ ]:
Pandas used for data manipulation 
Two datastructures in pandas are:
    1. Series
    2. Dataframe

In [3]:
import pandas as pd

In [2]:
print(pd.__version__)

1.5.3

## Series 1D array

In [7]:
list = [1,2,3,4,5]
label = ['a','b','c','d','e']

In [4]:
list

[1, 2, 3, 4, 5]

In [5]:
type(list)

list

In [8]:
# default indexing--> ser = pd.Series(list)
ser = pd.Series(list,index=label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
Difference bw series and numpy array

>if no. of rows is greater than 500K performance of pandas is better
500K< Numpy array are used

In [9]:
Marks = {"maths":43, "Science":80, "Physics":46, "Chemistry":95}
Marks

{'maths': 43, 'Science': 80, 'Physics': 46, 'Chemistry': 95}

In [10]:
ser = pd.Series(Marks)
ser

maths        43
Science      80
Physics      46
Chemistry    95
dtype: int64

In [11]:
ser = pd.Series(Marks, index=["maths","Science","Physics"])
ser

maths      43
Science    80
Physics    46
dtype: int64

In [ ]:
## Access the particular col, eg. maths, science

## Series Indexing

In [12]:
ser

maths      43
Science    80
Physics    46
dtype: int64

In [15]:
ser["Science"]
ser[1]

80

## Slicing

In [16]:
ser[1:3]

Science    80
Physics    46
dtype: int64

In [19]:
ser[1:]

Science    80
Physics    46
dtype: int64

In [18]:
ser["maths":"Physics"]

maths      43
Science    80
Physics    46
dtype: int64

In [20]:
ser

maths      43
Science    80
Physics    46
dtype: int64

In [21]:
ser.shape

(3,)

In [22]:
type(ser)

pandas.core.series.Series

## Dataframe

In [ ]:
# 2D rray, table with rows and columns

In [33]:
list = [[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]
columns = ['a','b','c','d']
labels = ['A','B','C','D']
list

[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]

In [36]:
df = pd.DataFrame(list, index=labels, columns=columns)

In [37]:
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [5]:
df = pd.DataFrame({"Name":["Vishwa","Saanvi","chetan","priya"], "Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [6]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df.shape

(4, 3)

In [42]:
df.columns

Index(['Name', 'Age', 'Branch'], dtype='object')

In [44]:
df1 = df.rename(columns={"Name":"Name_new"})
df1

  Name_new  Age Branch
0   Vishwa    2     AI
1   Saanvi    5     ML
2   chetan   10    ECE
3    priya   15    EEE

In [48]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [47]:
df.columns[[0,1]]

Index(['Name', 'Age'], dtype='object')

In [49]:
df.columns.values

array(['Name', 'Age', 'Branch'], dtype=object)

In [61]:
df = pd.DataFrame({"Name":["Vishwa","Saanvi","chetan","priya"], "Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [7]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [57]:
df.drop("Name", axis=1, inplace=True) #inplace=True, commit the changes

In [62]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [59]:
df["place"]=["hyd","Vellore","Chennai","AP"]

In [8]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [63]:
df = pd.DataFrame({"Name":["Vishwa","Saanvi","chetan","priya"], "Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [11]:
df1 = pd.DataFrame({"Name":["a","b","c","d"], "Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"],"Place":["hyd","Vellore","Chennai","AP"]})

In [9]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [12]:
df1

  Name  Age Branch    Place
0    a    2     AI      hyd
1    b    5     ML  Vellore
2    c   10    ECE  Chennai
3    d   15    EEE       AP

In [13]:
df3 = pd.concat([df,df1])
df3

     Name  Age Branch    Place
0  Vishwa    2     AI      NaN
1  Saanvi    5     ML      NaN
2  chetan   10    ECE      NaN
3   priya   15    EEE      NaN
0       a    2     AI      hyd
1       b    5     ML  Vellore
2       c   10    ECE  Chennai
3       d   15    EEE       AP

In [14]:
df3 = df.append(df1, ignore_index="True")

C:\Users\acer\AppData\Local\Temp\ipykernel_5384\1396416884.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df.append(df1, ignore_index="True")

In [15]:
df3

     Name  Age Branch    Place
0  Vishwa    2     AI      NaN
1  Saanvi    5     ML      NaN
2  chetan   10    ECE      NaN
3   priya   15    EEE      NaN
4       a    2     AI      hyd
5       b    5     ML  Vellore
6       c   10    ECE  Chennai
7       d   15    EEE       AP

## Handle null/missing values

In [ ]:
1. delete the row, column
2. imputing the values

In [ ]:
10000 records/rows 
where 50 records null values---- delete row
      5000 records null values----not good to delete rows
      so here imputing is better
        
70-80% is null in particular column---- delete column

In [17]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [18]:
df1.isnull()

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [19]:
df1.isnull().any() #return columns that contains null values

Name      True
score1    True
score2    True
dtype: bool

In [20]:
df1.isnull().sum() #how many null values in a particular col

Name      2
score1    2
score2    2
dtype: int64

In [22]:
#1. deleting the rows containing null values

df1.dropna(inplace=True)

In [23]:
df1

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [24]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [25]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [26]:
#deleting the columns
df1.dropna(axis=1,inplace=True)

In [27]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [ ]:
# Imputing the value
1 2 3 4 5 5
Mean 1+2+3+4+5+5/5
Median--3+4/2
Mode--5

In [62]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [29]:
df1["score1"].mean()

4.5

In [30]:
df1["score1"] = df1["score1"].fillna(df1["score1"].mean())

In [31]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [33]:
df1["score2"].median()

5.0

In [34]:
df1["score2"] = df1["score2"].fillna(df1["score2"].median())

In [35]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [38]:
df1["Name"].mode()

0    saanvi
Name: Name, dtype: object

In [41]:
df1["Name"] = df1["Name"].fillna(df1["Name"].mode()[0])

In [42]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [43]:
df1.Name.value_counts()

saanvi     4
tulasi     1
supriya    1
Name: Name, dtype: int64

In [44]:
group = df1.groupby("Name")

In [45]:
group

In [46]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

In [48]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [47]:
df1.shape

(6, 3)

In [49]:
df1.head()

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0

In [50]:
df1.head(2)

     Name  score1  score2
0  tulasi     5.0     5.0
1  saanvi     4.0     5.0

In [51]:
df1.tail()

      Name  score1  score2
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [52]:
df1.tail(2)

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [ ]:
Accesing the rows and columns

In [54]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [59]:
loc
iloc #for accesing the dataframe

In [63]:
df2=df1.loc[0]

In [64]:
df2

Name      tulasi
score1       5.0
score2       NaN
Name: 0, dtype: object

In [65]:
type(df2)

pandas.core.series.Series

In [66]:
df1.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0

In [1]:
data = {
    "calories": [420,125,154],
    "duration": [50,40,45]
}

In [2]:
data

{'calories': [420, 125, 154], 'duration': [50, 40, 45]}

In [3]:
import pandas as pd

In [7]:
df = pd.DataFrame(data,index=["day1","day2","day3"])

In [8]:
df

      calories  duration
day1       420        50
day2       125        40
day3       154        45

In [9]:
df.loc['day2']

calories    125
duration     40
Name: day2, dtype: int64

In [ ]:
loc ----- labelled indexes
iloc ----- integer based indexes

In [10]:
df = pd.DataFrame({"Name":["Vishwa","Saanvi","chetan","priya"], "Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [11]:
df

     Name  Age Branch
0  Vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [16]:
df.iloc[1:3,0:2]

     Name  Age
1  Saanvi    5
2  chetan   10

In [18]:
df.iloc[2:3+1,1:2+1]

   Age Branch
2   10    ECE
3   15    EEE

In [19]:
df.iloc[3:,0:]

    Name  Age Branch
3  priya   15    EEE

In [20]:
df.iloc[3:,0:1]

    Name
3  priya

In [27]:
df.loc[:,["Name","Branch"]]

     Name Branch
0  Vishwa     AI
1  Saanvi     ML
2  chetan    ECE
3   priya    EEE